{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/vlai-gpt-oss/.cache/huggingface/hub/models--KoiiVN--final_llama_3b_sft_raw/snapshots/b22d7d7a3fe145ed7ee25ce15757e51b9c89184f",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "up_proj",
    "k_proj",
    "q_proj",
    "o_proj",
    "gate_proj",
    "v_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}